Конфигурация/DataProcessors/ПечатьИВыгрузкаДокументовПоНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьИВыгрузкаДокументовПоНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КППКрупнейшегоНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КИО</Name>
					<Comment>Код иностранной организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факсы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоНахождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыПИФ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УправляющиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СотрудникиОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиОрганизации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровАренды</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДоговораАренды</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьИВыгрузкаДокументовПоНедвижимости/Ext/ManagerModule.bsl
Функция ПолучитьДанныеПечатиСчетаФактуры(Запрос, ПараметрыПечати) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактура.Ссылка КАК Ссылка,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	СчетФактура.Дата КАК Дата,
	|	СчетФактура.Договор КАК Договор,
	|	СчетФактура.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	"""" КАК НомерИсправления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсправления,
	|	СчетФактура.Организация КАК Организация,
	|	Оплата.ВалютаОплаты КАК Валюта,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаАкта,
	|	"""" КАК НомерАкта,
	|	СчетФактура.Проведен КАК Проведен,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка) КАК ВидЗадолженностиНачисления,
	|	"""" КАК НомерСчета,
	|	НЕОПРЕДЕЛЕНО КАК СделкаСНедвижимостью
	|ПОМЕСТИТЬ _ДокументыКПечати
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура.Основания КАК СчетФактураОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
	|			ПО СчетФактураОснования.Основание = Оплата.Ссылка
	|		ПО (СчетФактураОснования.Ссылка = СчетФактура.Ссылка)
	|			И (СчетФактураОснования.НомерСтроки = 1)
	|ГДЕ
	|	СчетФактура.Ссылка = &Ссылка
	|	И СчетФактура.ТипСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗадолженности.Ссылка,
	|	НачислениеЗадолженности.Контрагент,
	|	НачислениеЗадолженности.СчетДоверительногоУправления,
	|	НачислениеЗадолженности.Дата,
	|	НачислениеЗадолженности.Договор,
	|	НачислениеЗадолженности.НомерСчетаФактуры,
	|	"""" КАК НомерИсправления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсправления,
	|	НачислениеЗадолженности.Организация,
	|	НачислениеЗадолженности.Валюта,
	|	ВЫБОР
	|		КОГДА ЗначенияДополнительныхСведенийАкт.Значение ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ НачислениеЗадолженности.Дата
	|	КОНЕЦ,
	|	ЕСТЬNULL(ЗначенияДополнительныхСведенийАкт.Значение, """"),
	|	НачислениеЗадолженности.Проведен,
	|	НачислениеЗадолженности.ВидЗадолженности,
	|	ЗначенияДополнительныхСведенийСчет.Значение,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийАкт
	|		ПО НачислениеЗадолженности.Ссылка = ЗначенияДополнительныхСведенийАкт.Объект
	|			И (ЗначенияДополнительныхСведенийАкт.Свойство.Ключ = ""НомерАктаВыданного"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийСчет
	|		ПО НачислениеЗадолженности.Ссылка = ЗначенияДополнительныхСведенийСчет.Объект
	|			И (ЗначенияДополнительныхСведенийСчет.Свойство.Ключ = ""НомерСчетаВыданного"")
	|ГДЕ
	|	НачислениеЗадолженности.Ссылка = &Ссылка
	|	И НачислениеЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАренде), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАрендеПеременнаяЧасть))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаЗадолженности.Ссылка,
	|	КорректировкаЗадолженности.Контрагент,
	|	КорректировкаЗадолженности.СчетДоверительногоУправления,
	|	НачислениеЗадолженности.Дата,
	|	КорректировкаЗадолженности.Договор,
	|	НачислениеЗадолженности.НомерСчетаФактуры,
	|	КорректировкаЗадолженности.НомерСчетаФактуры КАК НомерИсправления,
	|	КорректировкаЗадолженности.ДатаСчетаФактуры КАК ДатаИсправления,
	|	КорректировкаЗадолженности.Организация,
	|	НачислениеЗадолженности.Валюта,
	|	ВЫБОР
	|		КОГДА ЗначенияДополнительныхСведенийАкт.Значение ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ НачислениеЗадолженности.Дата
	|	КОНЕЦ,
	|	ЕСТЬNULL(ЗначенияДополнительныхСведенийАкт.Значение, """"),
	|	НачислениеЗадолженности.Проведен,
	|	НачислениеЗадолженности.ВидЗадолженности,
	|	ЗначенияДополнительныхСведенийСчет.Значение,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.КорректировкаЗадолженности КАК КорректировкаЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
	|		ПО КорректировкаЗадолженности.ОснованиеДляКорректировки = НачислениеЗадолженности.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийАкт
	|		ПО НачислениеЗадолженности.Ссылка = ЗначенияДополнительныхСведенийАкт.Объект
	|			И (ЗначенияДополнительныхСведенийАкт.Свойство.Ключ = ""НомерАктаВыданного"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийСчет
	|		ПО НачислениеЗадолженности.Ссылка = ЗначенияДополнительныхСведенийСчет.Объект
	|			И (ЗначенияДополнительныхСведенийСчет.Свойство.Ключ = ""НомерСчетаВыданного"")
	|ГДЕ
	|	КорректировкаЗадолженности.Ссылка = &Ссылка
	|	И НачислениеЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАренде), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАрендеПеременнаяЧасть))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктПриемаПередачиОбъектовНедвижимости.Ссылка,
	|	СделкаСНедвижимостью.Контрагент,
	|	АктПриемаПередачиОбъектовНедвижимости.СчетДоверительногоУправления,
	|	АктПриемаПередачиОбъектовНедвижимости.ДатаСчетаФактуры,
	|	СделкаСНедвижимостью.Договор,
	|	АктПриемаПередачиОбъектовНедвижимости.НомерСчетаФактуры,
	|	"""" КАК НомерИсправления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсправления,
	|	АктПриемаПередачиОбъектовНедвижимости.Организация,
	|	&ВалютаРубль,
	|	АктПриемаПередачиОбъектовНедвижимости.Дата,
	|	""б/н"",
	|	АктПриемаПередачиОбъектовНедвижимости.Проведен,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью),
	|	"""",
	|	СделкаСНедвижимостью.Ссылка
	|ИЗ
	|	Документ.АктПриемаПередачиОбъектовНедвижимости КАК АктПриемаПередачиОбъектовНедвижимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
	|		ПО АктПриемаПередачиОбъектовНедвижимости.Основание = СделкаСНедвижимостью.Ссылка
	|ГДЕ
	|	АктПриемаПередачиОбъектовНедвижимости.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДокументыКПечати.Дата КАК Дата,
	|	_ДокументыКПечати.Договор КАК Договор,
	|	_ДокументыКПечати.Контрагент КАК Контрагент,
	|	_ДокументыКПечати.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	_ДокументыКПечати.НомерИсправления КАК НомерИсправления,
	|	_ДокументыКПечати.ДатаИсправления КАК ДатаИсправления,
	|	_ДокументыКПечати.Организация КАК Организация,
	|	_ДокументыКПечати.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеОрганизацииПоУставу,
	|	РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда КАК КраткоеНаименованиеФонда,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.ЮридическийАдрес КАК АдресПродавца,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.ЮридическийАдресФИАС КАК ЮридическийАдресФИАСОрганизации,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.ИНН КАК ИННОрганизации,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.КППКрупнейшегоНалогоплательщика КАК КППКрупнейшегоНалогоплательщика,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицоОрганизации,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.СтранаРегистрации.Код КАК КодСтраныОрганизации,
	|	РеквизитыОрганизацииАнкетныеСрезПоследних.СтранаРегистрации.Наименование КАК СтранаОрганизации,
	|	_ДокументыКПечати.Ссылка КАК Ссылка,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеКонтрагентаПоУставу,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.ЮридическийАдрес КАК ЮридическийАдресКонтрагента,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.ЮридическийАдресФИАС КАК ЮридическийАдресФИАСКонтрагента,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.ИНН + ВЫБОР
	|		КОГДА РеквизитыПокупателяАнкетныеСрезПоследних.КПП = """"
	|			ТОГДА """"
	|		ИНАЧЕ ""/"" + РеквизитыПокупателяАнкетныеСрезПоследних.КПП
	|	КОНЕЦ КАК ИННКПППокупателя,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.ИНН КАК ИННПокупателя,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.КПП КАК КПППокупателя,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.ОГРН КАК ОГРНПокупателя,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.ДатаВыдачиОГРН КАК ДатаОГРНПокупателя,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.СтранаРегистрации.Код КАК КодСтраныПокупателя,
	|	РеквизитыПокупателяАнкетныеСрезПоследних.СтранаРегистрации.Наименование КАК СтранаПокупателя,
	|	_ДокументыКПечати.Валюта.НаименованиеПолное КАК Валюта,
	|	_ДокументыКПечати.Валюта.Код КАК ВалютаКод,
	|	РеквизитыФизическихЛицГлавБух.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицГлавБух.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицГлавБух.Отчество, 1, 1) + ""."" КАК ГлавБух,
	|	РеквизитыФизическихЛицГенДир.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицГенДир.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицГенДир.Отчество, 1, 1) + ""."" КАК ГенДир,
	|	_ДокументыКПечати.ДатаАкта КАК ДатаАкта,
	|	_ДокументыКПечати.НомерАкта КАК НомерАкта,
	|	_ДокументыКПечати.Проведен КАК Проведен,
	|	_ДокументыКПечати.ВидЗадолженностиНачисления КАК ВидЗадолженностиНачисления,
	|	_ДокументыКПечати.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Аренды) КАК ЭтоДоговорАренды,
	|	_ДокументыКПечати.Договор.НомерДоговора КАК НомерДоговора,
	|	_ДокументыКПечати.Договор.ДатаЗаключения КАК ДатаДоговора,
	|	СотрудникиОрганизацииГенДир.Должность.Наименование КАК ДолжностьГенДира,
	|	_ДокументыКПечати.НомерСчета КАК НомерСчета,
	|	УсловияДоговоровАрендыСрезПоследних.РасчетныйСчет.НомерСчета КАК РасчетныйСчетНомерСчета,
	|	УсловияДоговоровАрендыСрезПоследних.РасчетныйСчет.Банк.Город КАК БанкГород,
	|	РеквизитыБанкаСрезПоследних.КраткоеНаименованиеПоУставу КАК БанкКраткоеНаименованиеПоУставу,
	|	УсловияДоговоровАрендыСрезПоследних.РасчетныйСчет.Банк.Код КАК БанкБИК,
	|	УсловияДоговоровАрендыСрезПоследних.РасчетныйСчет.Банк.КоррСчет КАК РасчетныйСчетБанкКоррСчет
	|ПОМЕСТИТЬ _ШапкаСчетаФактуры
	|ИЗ
	|	_ДокументыКПечати КАК _ДокументыКПечати
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&Дата,
	|				Организация = &ОрганизацияДокумента
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И ЮрФизЛицо = ВЫРАЗИТЬ(&ОрганизацияДокумента КАК Справочник.Организации).ЮрФизЛицо) КАК РеквизитыОрганизацииАнкетныеСрезПоследних
	|		ПО _ДокументыКПечати.Организация.ЮрФизЛицо = РеквизитыОрганизацииАнкетныеСрезПоследних.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|				&Дата,
	|				Организация = &ОрганизацияДокумента
	|					И СчетДоверительногоУправления В
	|						(ВЫБРАТЬ
	|							_ДокументыКПечати.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|						ИЗ
	|							_ДокументыКПечати КАК _ДокументыКПечати)) КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ПО _ДокументыКПечати.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Дата, ) КАК РеквизитыПИФСрезПоследних
	|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&Дата,
	|				Организация = &ОрганизацияДокумента
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И ЮрФизЛицо В
	|						(ВЫБРАТЬ
	|							_ДокументыКПечати.Контрагент КАК Контрагент
	|						ИЗ
	|							_ДокументыКПечати КАК _ДокументыКПечати)) КАК РеквизитыПокупателяАнкетныеСрезПоследних
	|		ПО _ДокументыКПечати.Контрагент = РеквизитыПокупателяАнкетныеСрезПоследних.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И ЮрФизЛицо В
	|						(ВЫБРАТЬ
	|							Сотрудники.ЮрФизЛицо КАК ЮрФизЛицо
	|						ИЗ
	|							Справочник.Сотрудники КАК Сотрудники
	|						ГДЕ
	|							Сотрудники.Ссылка = &ГлавныйБухгалтер)) КАК РеквизитыФизическихЛицГлавБух
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И ЮрФизЛицо В
	|						(ВЫБРАТЬ
	|							Сотрудники.ЮрФизЛицо КАК ЮрФизЛицо
	|						ИЗ
	|							Справочник.Сотрудники КАК Сотрудники
	|						ГДЕ
	|							Сотрудники.Ссылка = &Директор)) КАК РеквизитыФизическихЛицГенДир
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Дата, Сотрудник = &Директор) КАК СотрудникиОрганизацииГенДир
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровАренды.СрезПоследних(
	|				&Дата,
	|				Организация = &ОрганизацияДокумента
	|					И Договор В
	|						(ВЫБРАТЬ
	|							_ДокументыКПечати.Договор КАК Договор
	|						ИЗ
	|							_ДокументыКПечати КАК _ДокументыКПечати)) КАК УсловияДоговоровАрендыСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Дата, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыБанкаСрезПоследних
	|			ПО УсловияДоговоровАрендыСрезПоследних.РасчетныйСчет.Банк.ЮрФизЛицо = РеквизитыБанкаСрезПоследних.ЮрФизЛицо
	|		ПО _ДокументыКПечати.Договор = УсловияДоговоровАрендыСрезПоследних.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДокументыКПечати.Ссылка КАК Ссылка,
	|	СчетФактураОснования.НомерСтроки КАК НомерСтроки,
	|	СчетФактураОснования.Содержание КАК Содержание,
	|	СчетФактураОснования.СуммаСНДС КАК СуммаСНДС,
	|	СчетФактураОснования.СтавкаНДС КАК СтавкаНДС,
	|	СчетФактураОснования.СуммаНДС КАК СуммаНДС,
	|	0 КАК КодЕдиницыИзмерения,
	|	0 КАК Количество,
	|	0 КАК СтоимостьБезНДС,
	|	"""" КАК НазначениеОбъектаНедвижимости,
	|	"""" КАК НаименованиеЕГРНОбъектаНедвижимости,
	|	"""" КАК КадастровыйНомерОбъектаНедвижимости,
	|	"""" КАК АдресОбъектаНедвижимости
	|ИЗ
	|	_ДокументыКПечати КАК _ДокументыКПечати
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.Основания КАК СчетФактураОснования
	|		ПО _ДокументыКПечати.Ссылка = СчетФактураОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ДокументыКПечати.Ссылка,
	|	НачислениеЗадолженностиОснования.НомерСтроки,
	|	НачислениеЗадолженностиОснования.Содержание,
	|	НачислениеЗадолженностиОснования.Сумма,
	|	НачислениеЗадолженностиОснования.СтавкаНДС,
	|	НачислениеЗадолженностиОснования.СуммаНДС,
	|	ВЫБОР
	|		КОГДА НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАренде)
	|			ТОГДА ""362""
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	1,
	|	НачислениеЗадолженностиОснования.Сумма - НачислениеЗадолженностиОснования.СуммаНДС,
	|	"""",
	|	"""",
	|	"""",
	|	""""
	|ИЗ
	|	_ДокументыКПечати КАК _ДокументыКПечати
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
	|		ПО _ДокументыКПечати.Ссылка = НачислениеЗадолженностиОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ДокументыКПечати.Ссылка,
	|	КорректировкаЗадолженностиОснования.НомерСтроки,
	|	КорректировкаЗадолженностиОснования.СодержаниеПосле,
	|	КорректировкаЗадолженностиОснования.СуммаПосле,
	|	КорректировкаЗадолженностиОснования.СтавкаНДСПосле,
	|	КорректировкаЗадолженностиОснования.СуммаНДСПосле,
	|	ВЫБОР
	|		КОГДА НачислениеЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАренде)
	|			ТОГДА ""362""
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	1,
	|	КорректировкаЗадолженностиОснования.СуммаПосле - КорректировкаЗадолженностиОснования.СуммаНДСПосле,
	|	"""",
	|	"""",
	|	"""",
	|	""""
	|ИЗ
	|	_ДокументыКПечати КАК _ДокументыКПечати
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности КАК КорректировкаЗадолженности
	|		ПО _ДокументыКПечати.Ссылка = КорректировкаЗадолженности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности.Основания КАК КорректировкаЗадолженностиОснования
	|		ПО _ДокументыКПечати.Ссылка = КорректировкаЗадолженностиОснования.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
	|		ПО КорректировкаЗадолженности.ОснованиеДляКорректировки = НачислениеЗадолженности.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ДокументыКПечати.Ссылка,
	|	АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.НомерСтроки,
	|	NULL,
	|	УсловияСделокСНедвижимостьюСрезПоследних.Сумма,
	|	УсловияСделокСНедвижимостьюСрезПоследних.СтавкаНДС,
	|	УсловияСделокСНедвижимостьюСрезПоследних.СуммаНДС,
	|	796,
	|	1,
	|	УсловияСделокСНедвижимостьюСрезПоследних.Сумма - УсловияСделокСНедвижимостьюСрезПоследних.СуммаНДС,
	|	РеквизитыОбъектовНедвижимостиСрезПоследних.НазначениеОбъектаНедвижимости,
	|	РеквизитыОбъектовНедвижимостиСрезПоследних.НаименованиеЕГРН,
	|	РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости.КадастровыйНомер,
	|	РеквизитыОбъектовНедвижимостиСрезПоследних.Адрес
	|ИЗ
	|	_ДокументыКПечати КАК _ДокументыКПечати
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
	|		ПО _ДокументыКПечати.Ссылка = АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
	|				&Дата,
	|				Организация = &ОрганизацияДокумента
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|					И Основание В
	|						(ВЫБРАТЬ
	|							_ДокументыКПечати.СделкаСНедвижимостью КАК СделкаСНедвижимостью
	|						ИЗ
	|							_ДокументыКПечати КАК _ДокументыКПечати)) КАК УсловияСделокСНедвижимостьюСрезПоследних
	|		ПО _ДокументыКПечати.СделкаСНедвижимостью = УсловияСделокСНедвижимостьюСрезПоследних.Основание
	|			И (НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено)
	|			И (АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
	|				&Дата,
	|				Организация = &ОрганизацияДокумента
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
	|		ПО (УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости = РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыПечати.Ссылка, "Организация, Дата, СчетДоверительногоУправления");
	
	Запрос.Параметры.Вставить("Ссылка", ПараметрыПечати.Ссылка);
	Запрос.Параметры.Вставить("ОрганизацияДокумента", РеквизитыДокумента.Организация);
	Запрос.Параметры.Вставить("Организация", ПараметрыПечати.Организация);
	Запрос.Параметры.Вставить("СчетДоверительногоУправления", РеквизитыДокумента.СчетДоверительногоУправления);
	Запрос.Параметры.Вставить("Дата", РеквизитыДокумента.Дата);
	Запрос.Параметры.Вставить("ГруппаВидовОпераций", ОбщегоНазначения.ПолучитьИменованныйОбъект("ОперацииБухучета"));
	Запрос.Параметры.Вставить("Директор", ПараметрыПечати.Директор);
	Запрос.Параметры.Вставить("ГлавныйБухгалтер", ПараметрыПечати.ГлавныйБухгалтер);
	Запрос.Параметры.Вставить("ВалютаРубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ВыбратьПлатежныеДокументы(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактура") Тогда
		
		Возврат Документы.СчетФактура.ВыбратьПлатежныеДокументы(Ссылка);
		
	Иначе
		
		Результат = "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РеестрПлатежей.СтрокаБанковскойВыписки.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
			|	РеестрПлатежей.СтрокаБанковскойВыписки.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
			|		ПО ЗадолженностиПоДенежнымСредствам.Основание = РеестрПлатежей.ДвижениеДенежныхСредств
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Ссылка
			|	И ЗадолженностиПоДенежнымСредствам.Аванс";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Возврат Запрос.Выполнить();
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАвансовыеСчФ(Ссылка, ВернутьВыборку = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактура.НомерСчетаФактуры КАК НомерСчетаФактуры,
		|	СчетФактура.Дата КАК Дата
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактура
		|		ПО (СчетФактура.Ссылка = ЗадолженностиПоДенежнымСредствам.Основание)
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Ссылка
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам)
		|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетФактура.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = "";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВернутьВыборку Тогда
		Возврат ВыборкаДетальныеЗаписи;
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Результат <> "" Тогда
			Результат = Результат + "; ";
		КонецЕсли;
		
		Результат = Результат + "№ " + ВыборкаДетальныеЗаписи.НомерСчетаФактуры + " от " + Формат(ВыборкаДетальныеЗаписи.Дата, "ДФ=dd.MM.yyyy")
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция НомерФорматаУПД(СсылкаДокумент)
	
	ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДокумент, "Дата");
	//Если ТекущаяДата() >= Дата(2025, 1, 10) И ДатаДокумента >= Дата(2025, 1, 10) Тогда
	Если ТекущаяДата() >= Дата(2025, 2, 19) И ДатаДокумента >= Дата(2025, 2, 19) Тогда
		НомерФормата = "1032";
	ИначеЕсли ТекущаяДата() >= Дата(2025, 3, 30) И ДатаДокумента >= Дата(2025, 3, 30) Тогда
		НомерФормата = "970"; //Этот формат никогда не был использован
	Иначе	
		НомерФормата = "820";
	КонецЕсли;	
	Возврат НомерФормата;
	
КонецФункции	

Функция ВыгрузитьСчетФактуруВКонтур(СсылкаСчетФактура, ЭтоАкт = Ложь) Экспорт
	
	НомерФормата = НомерФорматаУПД(СсылкаСчетФактура);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Ссылка",           СсылкаСчетФактура);
	ПараметрыПечати.Вставить("Организация", 	 Справочники.Организации.ПустаяСсылка());
	ПараметрыПечати.Вставить("Директор",         Справочники.ЮрФизЛица.ПустаяСсылка());
	ПараметрыПечати.Вставить("ГлавныйБухгалтер", Справочники.ЮрФизЛица.ПустаяСсылка());
	
	РезультатЗапроса = ПолучитьДанныеПечатиСчетаФактуры(Запрос, ПараметрыПечати);
	
	ВыборкаШапка = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ШапкаСчетаФактуры").Выбрать();

	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда
		
		Если НомерФормата = "820" Тогда
			ИмяСхемы = "ON_NSCHFDOPPR_2019";
		ИначеЕсли НомерФормата = "970" Тогда
			ИмяСхемы = "ON_NSCHFDOPPR_2025";
		Иначе
			ИмяСхемы = "ON_NSCHFDOPPR_2024_5_03";
		КонецЕсли;	
		
		ПутьККаталогуВремФайлов = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор);
		КаталогНаДиске = Новый Файл(ПутьККаталогуВремФайлов);
		Если Не КаталогНаДиске.Существует() Тогда
			СоздатьКаталог(ПутьККаталогуВремФайлов);
		КонецЕсли;
		ФайлСхемы = ПутьККаталогуВремФайлов + "\" + ИмяСхемы + ".xsd";
		МакетСоСхемой = ПолучитьМакет(ИмяСхемы);
		
		МакетСоСхемой.Записать(ФайлСхемы);
		
		ИдентификаторОтправителя = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(,
			"ИдентификаторУчастникаЭДО",
			ВыборкаШапка.ЮрФизЛицоОрганизации);
		Если Не ЗначениеЗаполнено(ИдентификаторОтправителя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан идентификатор участника ЭДО для юрлица "
				+ ВыборкаШапка.КраткоеНаименованиеОрганизацииПоУставу+"!");
			Возврат Неопределено;
		КонецЕсли;
		
		ИдентификаторПолучателя = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(,
			"ИдентификаторУчастникаЭДО",
			ВыборкаШапка.Контрагент);
		Если Не ЗначениеЗаполнено(ИдентификаторПолучателя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан идентификатор участника ЭДО для юрлица "
				+ ВыборкаШапка.КраткоеНаименованиеКонтрагентаПоУставу+"!");
			Возврат Неопределено;
		КонецЕсли;
		
		КаталогДляФайловЭДО = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(,
			"КаталогДляФайловЭДО",
			ВыборкаШапка.СчетДоверительногоУправления);
		
		Если Не ЗначениеЗаполнено(КаталогДляФайловЭДО) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета внутреннего учета не задан каталог для файлов ЭДО");
			Возврат Неопределено;
		КонецЕсли;
		
		ЭтоАвансовыйСчФ = ТипЗнч(ВыборкаШапка.Ссылка) = Тип("ДокументСсылка.СчетФактура");
		
		// Проверка на наличие номеров акта, счета-фактуры
		Если Не ЭтоАвансовыйСчФ И Не ЗначениеЗаполнено(ВыборкаШапка.НомерАкта) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан номер акта!");
			Возврат Неопределено;
		ИначеЕсли Не ЗначениеЗаполнено(ВыборкаШапка.НомерСчетаФактуры) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан номер счета-фактуры!");
			Возврат Неопределено;
		КонецЕсли;	
		
		НоваяФабрикаXDTO = СоздатьФабрикуXDTO(ФайлСхемы);
		
		ТипФайл       = НоваяФабрикаXDTO.Тип(ИмяСхемы, "Файл");
		ТипДокумент   = ТипФайл.Свойства.Получить("Документ").Тип;
		ТипСвСчФакт   = ТипДокумент.Свойства.Получить("СвСчФакт").Тип;
		ТипИнфПолФХЖ1 = ТипСвСчФакт.Свойства.Получить("ИнфПолФХЖ1").Тип;
		ТипТаблСчФакт = ТипДокумент.Свойства.Получить("ТаблСчФакт").Тип;
		ТипСведТов    = ТипТаблСчФакт.Свойства.Получить("СведТов").Тип;
		ТипСвПродПер  = ТипДокумент.Свойства.Получить("СвПродПер").Тип;
		ТипСвПер      = ТипСвПродПер.Свойства.Получить("СвПер").Тип;
		
		ФайлСчФ = НоваяФабрикаXDTO.Создать(ТипФайл);
		
		Если НомерФормата = "820" Тогда
			ВерсияФормата = "5.01";
		ИначеЕсли НомерФормата = "970" Тогда
			ВерсияФормата = "5.02";
		ИначеЕсли НомерФормата = "1032" Тогда
			ВерсияФормата = "5.03";
		КонецЕсли;
		
		ИДФайл = СтрШаблон("%1_%2_%3_%4_%5%6", "ON_NSCHFDOPPR",
						                    ИдентификаторПолучателя,
						                    ИдентификаторОтправителя,
 						                    Формат(ТекущаяДата(), "ДФ=yyyyMMdd"),
						                    ?(ЭтоАкт, Новый УникальныйИдентификатор, СсылкаСчетФактура.УникальныйИдентификатор()),
						                    ?((НомерФормата = "970") Или (НомерФормата = "1032"), "_0_0_0_0_0_00", ""));  
		// https://support.kontur.ru/diadoc-1s8x/51973-zapolnenie_idfajl_dlya_upd#:~:text=%D0%98%D0%B4%D0%A4%D0%B0%D0%B9%D0%BB%20%D1%84%D0%BE%D1%80%D0%BC%D0%B8%D1%80%D1%83%D0%B5%D1%82%D1%81%D1%8F%20%D0%BF%D0%BE%20%D1%81%D0%BB%D0%B5%D0%B4%D1%83%D1%8E%D1%89%D0%B8%D0%BC%20%D0%BF%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0%D0%BC,N2_%20N3_%20N4_%20N5_N6_%20N7.											
			
		ФайлСчФ.ИДФайл 	 = ИДФайл;
		ФайлСчФ.ВерсФорм = ВерсияФормата;
		ФайлСчФ.ВерсПрог = "1С 8.3";
		
		Если НомерФормата = "820" Тогда
			ФайлСчФ.СвУчДокОбор = ДобавитьЗначениеСвУчДокОбор(НоваяФабрикаXDTO, ТипФайл, ИдентификаторОтправителя, ИдентификаторПолучателя);
		КонецЕсли;	
		
		// Документ
		Документ = НоваяФабрикаXDTO.Создать(ТипДокумент);
		
		Документ.КНД 		= НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(ИмяСхемы, "КНДТип"), "1115131");
		Если ЭтоАкт Тогда
			Документ.Функция 	= "ДОП";
			Документ.ПоФактХЖ 	= "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
			Документ.НаимДокОпр = "Акт";
		Иначе
			Документ.Функция 	= "СЧФ";
		КонецЕсли;
		Документ.ДатаИнфПр 		 = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		Документ.ВремИнфПр 		 = Формат(ТекущаяДата(), "ДФ='HH.mm.ss'");
		Документ.НаимЭконСубСост = ВыборкаШапка.КраткоеНаименованиеОрганизацииПоУставу + " Д.У. " + ВыборкаШапка.КраткоеНаименованиеФонда;
		
		СвСчФакт = НоваяФабрикаXDTO.Создать(ТипСвСчФакт);
        Если НомерФормата = "820" Тогда
			СвСчФакт.ДатаСчФ = Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy");
			СвСчФакт.КодОКВ	 = ВыборкаШапка.ВалютаКод;
		Иначе
			СвСчФакт.ДатаДок = Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		
		
		НомерДокумента = ?(ЭтоАкт, ВыборкаШапка.НомерАкта, ВыборкаШапка.НомерСчетаФактуры);
		Если НомерФормата = "820" Тогда
			СвСчФакт.НомерСчФ = НомерДокумента;
		Иначе
			СвСчФакт.НомерДок = НомерДокумента;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ВыборкаШапка.НомерИсправления) Тогда
			ИспрДок = НоваяФабрикаXDTO.Создать(ТипСвСчФакт.Свойства.Получить("ИспрДок").Тип);
			ИспрДок.НомИспр = ВыборкаШапка.НомерИсправления;
			ИспрДок.ДатаИспр = Формат(ВыборкаШапка.ДатаИсправления, "ДФ=dd.MM.yyyy");
			
			СвСчФакт.ИспрДок = ИспрДок;
		КонецЕсли;

		// Сведения о продавце
		СвСчФакт.СвПрод.Добавить(ДобавитьЗначениеТипаУчастникТип(
			НоваяФабрикаXDTO,
			ИмяСхемы,
			Новый Структура("КраткоеНаименованиеПоУставу, ИНН, КПП, КодСтраны, Страна, Адрес",
				ВыборкаШапка.КраткоеНаименованиеОрганизацииПоУставу + " Д.У. " + ВыборкаШапка.КраткоеНаименованиеФонда,
				ВыборкаШапка.ИННОрганизации,
				ВыборкаШапка.КППКрупнейшегоНалогоплательщика,
				ВыборкаШапка.КодСтраныОрганизации,
				ВыборкаШапка.СтранаОрганизации,
				Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ПолучитьАдресПродавцаДляСчетаФактуры(ВыборкаШапка.Организация, ВыборкаШапка.АдресПродавца)),
				НомерФормата));
		
		// Платежно-расчетные документы
		ВыборкаПлатежныеДокументы = ВыбратьПлатежныеДокументы(СсылкаСчетФактура).Выбрать();
		Пока ВыборкаПлатежныеДокументы.Следующий() Цикл
			СвПРД = НоваяФабрикаXDTO.Создать(ТипСвСчФакт.Свойства.Получить("СвПРД").Тип);
			СвПРД.НомерПРД 	= ВыборкаПлатежныеДокументы.НомерПлатежногоДокумента;
			СвПРД.ДатаПРД 	= Формат(ВыборкаПлатежныеДокументы.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy");
			
			СвСчФакт.СвПРД.Добавить(СвПРД);
		КонецЦикла;
		
		// Сведения о покупателе
		СвСчФакт.СвПокуп.Добавить(ДобавитьЗначениеТипаУчастникТип(
			НоваяФабрикаXDTO,
			ИмяСхемы,
			Новый Структура("КраткоеНаименованиеПоУставу, ИНН, КПП, ОГРН, ДатаОГРН, КодСтраны, Страна, Адрес",
				ВыборкаШапка.КраткоеНаименованиеКонтрагентаПоУставу,
				ВыборкаШапка.ИННПокупателя,
				ВыборкаШапка.КПППокупателя,
				ВыборкаШапка.ОГРНПокупателя,
				ВыборкаШапка.ДатаОГРНПокупателя,
				ВыборкаШапка.КодСтраныПокупателя,
				ВыборкаШапка.СтранаПокупателя,
				ВыборкаШапка.ЮридическийАдресКонтрагента),
		        НомерФормата));
		
		// Валюта и обстоятельства
		ДопСвФХЖ1 = НоваяФабрикаXDTO.Создать(ТипСвСчФакт.Свойства.Получить("ДопСвФХЖ1").Тип);
		Если НомерФормата = "820" Тогда
			ДопСвФХЖ1.НаимОКВ = ВыборкаШапка.Валюта;
			Если ВыборкаШапка.ВалютаКод = "643" Тогда
				ДопСвФХЖ1.КурсВал = 1;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано отражение курса валюты в файле выгрузки. Обратитесь к программисту");
				Возврат Неопределено;
			КонецЕсли; 
			Если Не ЭтоАкт Тогда
				ДопСвФХЖ1.ОбстФормСЧФ = ?(ЭтоАвансовыйСчФ, "2", "1");
			КонецЕсли;
			СвСчФакт.ДопСвФХЖ1 = ДопСвФХЖ1;
		Иначе // 970
			Если Не ЭтоАкт Тогда
				// В новом 970 формате специальные обстоятельства формирования счета-фактуры заполняются только если они присутствуют. Формирование счета-фактуры на аванс это специальное обстоятельство
				// https://www.diadoc.ru/blog/50533-novyy_format_upd?utm_referrer=https%3a%2f%2fwww.google.com%2f
				ФлагДопСвФХЖ1 = Ложь;
				Если ЭтоАвансовыйСчФ Тогда
					ДопСвФХЖ1.СпОбстФСЧФ = "2";
					ФлагДопСвФХЖ1 = Истина;
				КонецЕсли;                                           
				ВыборкаАвансСФ = ПолучитьАвансовыеСчФ(СсылкаСчетФактура, Истина);
				Пока ВыборкаАвансСФ.Следующий() Цикл
					СопрДокФХЖ = НоваяФабрикаXDTO.Создать(ДопСвФХЖ1.СопрДокФХЖ.ВладеющееСвойство.Тип);
					СопрДокФХЖ.РеквНаимДок = "АСЧФ";
					СопрДокФХЖ.РеквНомерДок = ВыборкаАвансСФ.НомерСчетаФактуры;
					СопрДокФХЖ.РеквДатаДок = Формат(ВыборкаАвансСФ.Дата, "ДФ=dd.MM.yyyy");
					
					ДопСвФХЖ1.СопрДокФХЖ.Добавить(СопрДокФХЖ);
					ФлагДопСвФХЖ1 = Истина;
				КонецЦикла;
				Если ФлагДопСвФХЖ1 Тогда
					СвСчФакт.ДопСвФХЖ1 = ДопСвФХЖ1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЭтоАкт Тогда
			// Документ подтверждающий отгрузку
			Если (ТипЗнч(СсылкаСчетФактура) = Тип("ДокументСсылка.НачислениеЗадолженности")
				Или ТипЗнч(СсылкаСчетФактура) = Тип("ДокументСсылка.АктПриемаПередачиОбъектовНедвижимости")) Тогда

				Если НомерФормата = "820" Тогда
					ДокПодтвОтгр = НоваяФабрикаXDTO.Создать(ТипСвСчФакт.Свойства.Получить("ДокПодтвОтгр").Тип);
					Если ВыборкаШапка.ДатаАкта >= Дата(2024, 10, 1) Тогда
						ДокПодтвОтгр.НаимДокОтгр = "Акт сдачи-приемки";
					Иначе
						ДокПодтвОтгр.НаимДокОтгр = "Акт";
					КонецЕсли;
					ДокПодтвОтгр.НомДокОтгр = ВыборкаШапка.НомерАкта;
					ДокПодтвОтгр.ДатаДокОтгр = Формат(ВыборкаШапка.ДатаАкта, "ДФ=dd.MM.yyyy");
					СвСчФакт.ДокПодтвОтгр.Добавить(ДокПодтвОтгр);
				Иначе
					// Элемент ДокПодтвОтгрНом обязателен при <Функция>=СЧФ, кроме случая, когда <СпОбстФСЧФ> = 2.
					Если Не ЭтоАвансовыйСчФ Тогда 
						ДокПодтвОтгрНом = НоваяФабрикаXDTO.Создать(ТипСвСчФакт.Свойства.Получить("ДокПодтвОтгрНом").Тип);
						Если ВыборкаШапка.ДатаАкта >= Дата(2024, 10, 1) Тогда
							ДокПодтвОтгрНом.РеквНаимДок = "Акт сдачи-приемки";
						Иначе
							ДокПодтвОтгрНом.РеквНаимДок = "Акт";
						КонецЕсли;
						ДокПодтвОтгрНом.РеквНомерДок = ВыборкаШапка.НомерАкта;
						ДокПодтвОтгрНом.РеквДатаДок  = Формат(ВыборкаШапка.ДатаАкта, "ДФ=dd.MM.yyyy");
						СвСчФакт.ДокПодтвОтгрНом.Добавить(ДокПодтвОтгрНом);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоАкт Тогда
			
			ИнфПолФХЖ1 = НоваяФабрикаXDTO.Создать(ТипИнфПолФХЖ1);
			
			ТекстИнф = НоваяФабрикаXDTO.Создать(ТипИнфПолФХЖ1.Свойства.Получить("ТекстИнф").Тип);
			ТекстИнф.Идентиф = "_";
			ТекстИнф.Значен = "Услуги выполнены полностью и в срок, результаты оказанных услуг приняты без претензий";
			ИнфПолФХЖ1.ТекстИнф.Добавить(ТекстИнф);
			
			СвСчФакт.ИнфПолФХЖ1 = ИнфПолФХЖ1;
			
		КонецЕсли;
		
		Если (НомерФормата = "970") Или (НомерФормата = "1032") Тогда
			ДенИзм = НоваяФабрикаXDTO.Создать(ТипСвСчФакт.Свойства.Получить("ДенИзм").Тип);
			ДенИзм.КодОКВ  = ВыборкаШапка.ВалютаКод;
			ДенИзм.НаимОКВ = ВыборкаШапка.Валюта;
			Если ВыборкаШапка.ВалютаКод = "643" Тогда
				ДенИзм.КурсВал = 1;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано отражение курса валюты в файле выгрузки. Обратитесь к программисту");
				Возврат Неопределено;
			КонецЕсли;
			
			СвСчФакт.ДенИзм = ДенИзм;
		КонецЕсли;	
		
		Документ.СвСчФакт = СвСчФакт;

		
		ТаблСчФакт = НоваяФабрикаXDTO.Создать(ТипТаблСчФакт);
		
		ЕдиницыИзмерения = Документы.НачислениеЗадолженности.ПолучитьСписокЕдиницИзмерения();
		СодержаниеИспользуетсяДляХраненияДанных = Документы.НачислениеЗадолженности.СодержаниеИспользуетсяДляХраненияДанных(ВыборкаШапка.ВидЗадолженностиНачисления);
		
		ИтогоСуммаНДС = 0;
		ИтогоСуммаСНДС = 0;
		ИтогоСтоимостьБезНДС = 0;
		ИтогоКоличество = 0;
		ЕстьБезНДС = Ложь;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СведТов = НоваяФабрикаXDTO.Создать(ТипСведТов);
			ДопСведТов = НоваяФабрикаXDTO.Создать(ТипСведТов.Свойства.Получить("ДопСведТов").Тип);
			СведТов.НомСтр = ВыборкаДетальныеЗаписи.НомерСтроки;
			
			ИспользуемоеКоличествоТоваров = 0;
			Если СодержаниеИспользуетсяДляХраненияДанных Тогда // ВидыЗадолженности.ПоНалогуНаИмущество, ВидыЗадолженности.ПоАрендеПеременнаяЧасть
				
				ДополнительныеДанные = Документы.НачислениеЗадолженности.ПолучитьДополнительныеДанныеИзСодержания(ВыборкаДетальныеЗаписи.Содержание);
				Если ДополнительныеДанные <> Неопределено Тогда
					Если ВыборкаШапка.ВидЗадолженностиНачисления = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть Тогда
						
						КоммунальныеУслуги = Неопределено;
						ДополнительныеДанные.Свойство("КоммунальныеУслуги", КоммунальныеУслуги);
						
						СведТов.НаимТов = КоммунальныеУслуги.Описание;
						ИспользуемоеКоличествоТоваров = КоммунальныеУслуги.Количество;
						
						Если НомерФормата = "820" Тогда
							СведТов.КолТов = Формат(ИспользуемоеКоличествоТоваров, "ЧЦ=26; ЧДЦ=11; ЧРД=.; ЧГ=0");
							Если КоммунальныеУслуги.ЕдиницаИзмерения <> "" Тогда
								СведТов.ОКЕИ_Тов = КоммунальныеУслуги.ЕдиницаИзмеренияКод;
								ДопСведТов.НаимЕдИзм = КоммунальныеУслуги.ЕдиницаИзмерения;
							Иначе
								СведТов.ДефОКЕИ_Тов = "-";
								ДопСведТов.НаимЕдИзм = "-";
							КонецЕсли;
						Иначе // 970
							Если КоммунальныеУслуги.ЕдиницаИзмерения <> "" Тогда
								СведТов.КолТов    = Формат(ИспользуемоеКоличествоТоваров, "ЧЦ=26; ЧДЦ=11; ЧРД=.; ЧГ=0");
								СведТов.ОКЕИ_Тов  = КоммунальныеУслуги.ЕдиницаИзмеренияКод;
								СведТов.НаимЕдИзм = КоммунальныеУслуги.ЕдиницаИзмерения;
							КонецЕсли;	
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружены сведения об оказании услуги");
					Возврат Неопределено;
				КонецЕсли;
				
			Иначе
				СведТов.НаимТов = ВыборкаДетальныеЗаписи.Содержание;
				ИспользуемоеКоличествоТоваров = ВыборкаДетальныеЗаписи.Количество;
				
				Если НомерФормата = "820" Тогда
					СведТов.КолТов = ИспользуемоеКоличествоТоваров;
					
					ТекЕдиницаИзмерения = ЕдиницыИзмерения.НайтиПоЗначению(ВыборкаДетальныеЗаписи.КодЕдиницыИзмерения);
					Если ТекЕдиницаИзмерения <> Неопределено Тогда
						СведТов.ОКЕИ_Тов 		= ВыборкаДетальныеЗаписи.КодЕдиницыИзмерения;
						ДопСведТов.НаимЕдИзм 	= ТекЕдиницаИзмерения.Представление;
					Иначе
						СведТов.ДефОКЕИ_Тов 	= "-";
						ДопСведТов.НаимЕдИзм 	= "-";
					КонецЕсли;
				Иначе // 970
					Если Не ЭтоАвансовыйСчФ Тогда
						ТекЕдиницаИзмерения = ЕдиницыИзмерения.НайтиПоЗначению(ВыборкаДетальныеЗаписи.КодЕдиницыИзмерения);
						Если ТекЕдиницаИзмерения <> Неопределено Тогда
							СведТов.КолТов    = ИспользуемоеКоличествоТоваров;
							СведТов.ОКЕИ_Тов  = ВыборкаДетальныеЗаписи.КодЕдиницыИзмерения;
							СведТов.НаимЕдИзм = ТекЕдиницаИзмерения.Представление;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
				
			КонецЕсли;
			
			Если НомерФормата = "820" Тогда
				СведТов.СтТовБезНДС = ВыборкаДетальныеЗаписи.СтоимостьБезНДС;
				СведТов.ЦенаТов 	= ?(ИспользуемоеКоличествоТоваров <> 0,	Формат(ВыборкаДетальныеЗаписи.СтоимостьБезНДС / ИспользуемоеКоличествоТоваров, "ЧЦ=26; ЧДЦ=3; ЧРД=.; ЧГ=0"), 0);
			Иначе // 970
				Если Не ЭтоАвансовыйСчФ Тогда
					СведТов.СтТовБезНДС = ВыборкаДетальныеЗаписи.СтоимостьБезНДС;
					СведТов.ЦенаТов     = ?(ИспользуемоеКоличествоТоваров <> 0,	Формат(ВыборкаДетальныеЗаписи.СтоимостьБезНДС / ИспользуемоеКоличествоТоваров, "ЧЦ=26; ЧДЦ=3; ЧРД=.; ЧГ=0"), 0);
				КонецЕсли;	
			КонецЕсли;	
				
				
			СведТов.НалСт 	   = СтавкаНалогаДляПечати(ВыборкаДетальныеЗаписи.СтавкаНДС, ЭтоАвансовыйСчФ);
			СведТов.СтТовУчНал = ВыборкаДетальныеЗаписи.СуммаСНДС;
			
			Акциз = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(ИмяСхемы, "СумАкцизТип"));
			Если ЭтоАвансовыйСчФ Тогда
				Акциз.СумАкциз = 0;
			Иначе
				Акциз.БезАкциз = "без акциза";
			КонецЕсли;
			СведТов.Акциз = Акциз;
			
			СумНал = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(ИмяСхемы, "СумНДСТип"));
			Если ВыборкаДетальныеЗаписи.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				СумНал.БезНДС 	= "без НДС";
				ЕстьБезНДС 		= Истина;
			Иначе
				СумНал.СумНал = ВыборкаДетальныеЗаписи.СуммаНДС;
			КонецЕсли;
			СведТов.СумНал 		= СумНал;
			Если НомерФормата = "820" Тогда
				СведТов.ДопСведТов 	= ДопСведТов;
			КонецЕсли;	
			
			ТаблСчФакт.СведТов.Добавить(СведТов);
			
			ИтогоСуммаНДС 			= ИтогоСуммаНДС + ВыборкаДетальныеЗаписи.СуммаНДС;
			ИтогоСуммаСНДС 			= ИтогоСуммаСНДС + ВыборкаДетальныеЗаписи.СуммаСНДС;
			ИтогоСтоимостьБезНДС 	= ИтогоСтоимостьБезНДС + ВыборкаДетальныеЗаписи.СтоимостьБезНДС;
			ИтогоКоличество         = ИтогоКоличество + ИспользуемоеКоличествоТоваров;
		КонецЦикла;
		
		// Итог
		ВсегоОпл = НоваяФабрикаXDTO.Создать(ТипТаблСчФакт.Свойства.Получить("ВсегоОпл").Тип);
		ВсегоОпл.СтТовБезНДСВсего 	= ИтогоСтоимостьБезНДС;
		ВсегоОпл.СтТовУчНалВсего 	= ИтогоСуммаСНДС;
		Если НомерФормата = "970" Или НомерФормата = "1032" Тогда
			ВсегоОпл.КолНеттоВс = ИтогоКоличество;
		КонецЕсли;	
		
		СумНалВсего = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(ИмяСхемы, "СумНДСТип"));
		Если ИтогоСуммаНДС <> 0 Тогда
			СумНалВсего.СумНал = ИтогоСуммаНДС;
		ИначеЕсли ЕстьБезНДС Тогда
			СумНалВсего.БезНДС = "без НДС";
		ИначеЕсли НомерФормата = "820" Тогда
			СумНалВсего.ДефНДС = "-";
		Иначе	
			СумНалВсего.СумНал = ИтогоСуммаНДС;
		КонецЕсли;
		
		ВсегоОпл.СумНалВсего = СумНалВсего;
		
		ТаблСчФакт.ВсегоОпл = ВсегоОпл;
		
		Документ.ТаблСчФакт = ТаблСчФакт;

		
		Если ЭтоАкт Тогда
			
			СвПродПер 	  = НоваяФабрикаXDTO.Создать(ТипСвПродПер);
			СвПер 		  = НоваяФабрикаXDTO.Создать(ТипСвПер);
			СвПер.СодОпер = "По договору услуги выполнены полностью и в срок, результаты оказанных услуг приняты без претензий";
			СвПер.ДатаПер = Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy");
			
			ОснПер 	= НоваяФабрикаXDTO.Создать(ТипСвПер.Свойства.Получить("ОснПер").Тип );
			Если НомерФормата = "820" Тогда
				ОснПер.НаимОсн = "Договор";
				ОснПер.НомОсн  = ВыборкаШапка.НомерДоговора;
				ОснПер.ДатаОсн = Формат(ВыборкаШапка.ДатаДоговора, "ДФ=dd.MM.yyyy");
			Иначе // 970	
				ОснПер.РеквНаимДок 	= "Договор";
				ОснПер.РеквНомерДок = ВыборкаШапка.НомерДоговора;
				ОснПер.РеквДатаДок 	= Формат(ВыборкаШапка.ДатаДоговора, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			СвПер.ОснПер.Добавить(ОснПер);
			
			СвПродПер.СвПер = СвПер;
			
			Документ.СвПродПер = СвПродПер;
			
		КонецЕсли;
		
		
		ФайлСчФ.Документ = Документ;
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "windows-1251");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		НоваяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ФайлСчФ);
		
		ЗаписьXML.Закрыть();
		
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.Прочитать(ИмяВременногоФайла,"windows-1251");
		ТекстовыйФайл.ЗаменитьСтроку(2, СтрЗаменить(ТекстовыйФайл.ПолучитьСтроку(2), "xmlns=""" + ИмяСхемы + """ xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" ", ""));
		ТекстовыйФайл.Записать(ИмяВременногоФайла,"windows-1251");
		
		ДвоичныеДанныеВыгрузки = Новый ДвоичныеДанные(ИмяВременногоФайла);
		УдалитьФайлы(ИмяВременногоФайла);
		Возврат Новый Структура("ИмяФайлаВыгрузки, Адрес", КаталогДляФайловЭДО + "\" + ИДФайл +".xml", ПоместитьВоВременноеХранилище(ДвоичныеДанныеВыгрузки));
		
	КонецЕсли;
	
КонецФункции

Функция ДобавитьЗначениеСвУчДокОбор(НоваяФабрикаXDTO, ТипФайл, ИдентификаторОтправителя, ИдентификаторПолучателя)

	ТипСвУчДокОбор = ТипФайл.Свойства.Получить("СвУчДокОбор").Тип;
	
	СвУчДокОбор = НоваяФабрикаXDTO.Создать(ТипСвУчДокОбор);
	СвУчДокОбор.ИдОтпр = ИдентификаторОтправителя;
	СвУчДокОбор.ИдПол = ИдентификаторПолучателя;		
	
	СвОЭДОтпр = НоваяФабрикаXDTO.Создать(ТипСвУчДокОбор.Свойства.Получить("СвОЭДОтпр").Тип);
	СвОЭДОтпр.НаимОрг = "АО &quot;ПФ &quot;СКБ Контур&quot;";
	СвОЭДОтпр.ИННЮЛ = "6663003127";
	СвОЭДОтпр.ИдЭДО = "2BM";
	
	СвУчДокОбор.СвОЭДОтпр = СвОЭДОтпр;
	
	Возврат СвУчДокОбор;
	
КонецФункции

Функция ДобавитьЗначениеТипаУчастникТип(НоваяФабрикаXDTO, ИмяСхемы, ПараметрыЮрЛица, НомерФормата = "820")
	
	ТипУчастникТип = НоваяФабрикаXDTO.Тип(ИмяСхемы, "УчастникТип");
	Участник       = НоваяФабрикаXDTO.Создать(ТипУчастникТип);
	
	ТипИдСв = ТипУчастникТип.Свойства.Получить("ИдСв").Тип;
	ИдСв    = НоваяФабрикаXDTO.Создать(ТипИдСв);
	
	Если СтрДлина(ПараметрыЮрЛица.ИНН) = 12 Тогда //Временная идентификация ИП, потом доделать полноценную обработку ООП Юр/Физ/ИП
		СвИП         = НоваяФабрикаXDTO.Создать(ТипИдСв.Свойства.Получить("СвИП").Тип);

		ТипФИОТип	 = НоваяФабрикаXDTO.Тип(ИмяСхемы, "ФИОТип");
		ФИО          = НоваяФабрикаXDTO.Создать(ТипФИОТип);
		ФИОм		 = СтрРазделить(ПараметрыЮрЛица.КраткоеНаименованиеПоУставу, " ");
		ФИО.Фамилия  = ФИОм[1];
		ФИО.Имя 	 = ФИОм[2];
		ФИО.Отчество = ФИОм[3];

		СвИП.ФИО		= ФИО;
		СвИП.ИННФЛ		= ПараметрыЮрЛица.ИНН;
		СвИП.СвГосРегИП = ПараметрыЮрЛица.ОГРН + " от " + Формат(ПараметрыЮрЛица.ДатаОГРН, "ДФ=dd.MM.yyyy");
		СвИП.ОГРНИП		= ПараметрыЮрЛица.ОГРН;
		СвИП.ДатаОГРНИП = Формат(ПараметрыЮрЛица.ДатаОГРН, "ДФ=dd.MM.yyyy");
		СвИП.ИныеСвед = "-";
		
		ИдСв.СвИП   = СвИП;
	Иначе
		СвЮЛУч         = НоваяФабрикаXDTO.Создать(ТипИдСв.Свойства.Получить("СвЮЛУч").Тип);
		СвЮЛУч.НаимОрг = ПараметрыЮрЛица.КраткоеНаименованиеПоУставу;
		СвЮЛУч.ИННЮл   = ПараметрыЮрЛица.ИНН;
		СвЮЛУч.КПП     = ПараметрыЮрЛица.КПП;
		
		ИдСв.СвЮЛУч   = СвЮЛУч;
	КонецЕсли;

	ИдСв.СвЮЛУч   = СвЮЛУч;
	Участник.ИдСв = ИдСв;
	
	ТипАдрес = НоваяФабрикаXDTO.Тип(ИмяСхемы, "АдресТип");
	Адрес    = НоваяФабрикаXDTO.Создать(ТипАдрес);

	ТипАдресИнф = НоваяФабрикаXDTO.Тип(ИмяСхемы, "АдрИнфТип");
	АдрИнф          = НоваяФабрикаXDTO.Создать(ТипАдресИнф);
	АдрИнф.КодСтр   = ПараметрыЮрЛица.КодСтраны;
	АдрИнф.АдрТекст = ПараметрыЮрЛица.Адрес;
	Если (НомерФормата = "970") Или ((НомерФормата = "1032")) Тогда
		АдрИнф.НаимСтран = ПараметрыЮрЛица.Страна;	
	КонецЕсли;	
	
	Адрес.АдрИнф = АдрИнф;
	
	Участник.Адрес = Адрес;
	
	Возврат Участник;
	
КонецФункции

Функция СтавкаНалогаДляПечати(СтавкаНДС, ЭтоАвансовыйСчФ) Экспорт
	
	Если ЭтоАвансовыйСчФ Тогда
		СтавкаСтрокой = РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(СтавкаНДС);
		Возврат "" + СтавкаСтрокой + "/1" + СтавкаСтрокой;
	Иначе
		Возврат Строка(СтавкаНДС);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАдресПродавцаДляСчетаФактуры(Организация, АдресПродавца) Экспорт
	
	Если Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда 
		Если АдресПродавца = "РОССИЯ, 123112, Город Москва, проезд 1-й Красногвардейский, Дом 22, Строение 1, Этаж 16, Помещение А16, Комната 25" Тогда
			Возврат "123112, г. Москва, вн. тер. г. муниципальный округ Пресненский, проезд 1-й Красногвардейский, д. 22, стр. 1, этаж 16, помещ. А16, ком. 25";
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("После смены адреса убедитесь, что формат адреса продавца устраивает бухгалтерию! Возможно, потребуется привлечение программиста для подмены адреса в формате ЕГРЮЛ");
			Возврат АдресПродавца;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
